sglahn/esp8266-sensor-board-firmware/src/Application.cpp
#include <ESP8266WiFi.h>

#include "EepromConfiguration.h"
#include "HttpServer.h"
#include "WifiManager.h"
#include "resources.h"
#include "Dht22Sensor.h"
#include "ThingspeakClient.h"

EepromConfiguration* eepromConfig;
HttpServer* httpServer;
WifiManager* wifiManager;
Dht22Sensor* dht22Sensor;
Configuration config;
ThingspeakClient* thingspeak;
bool CONFIG_MODE = false;

void restartHandler()
{
    ESP.restart();
}

void configurationPageHandler()
{
    httpServer->sendResponse(config);
}

void saveConfigurationHandler()
{
    strcpy(config.ssid, httpServer->getRequestArgument("ssid").c_str());
    strcpy(config.password, httpServer->getRequestArgument("password").c_str());
    strcpy(config.identifier, httpServer->getRequestArgument("identifier").c_str());
    config.sleepInterval = atoi(httpServer->getRequestArgument("sleepInterval").c_str());
    strcpy(config.thingspeakApiKey, httpServer->getRequestArgument("thingspeakKey").c_str());
    strcpy(config.otaUrl, httpServer->getRequestArgument("otaUrl").c_str());
    eepromConfig->writeConfigurationToEeprom(config);
}

void setup()
{
  eepromConfig = new EepromConfiguration();
  wifiManager = new WifiManager();
  thingspeak = new ThingspeakClient(config.thingspeakApiKey);
  dht22Sensor = new Dht22Sensor(5);

  Serial.begin(9600);
  while (!Serial) {
    ;
  }

  if (eepromConfig->isEepromEmpty())
  {
    eepromConfig->writeConfigurationToEeprom(eepromConfig->createDefaultConfiguration());
  }
  config = eepromConfig->readConfigurationFromEeprom();

  httpServer = new HttpServer(&config);
  httpServer->addHandler("/", std::bind(&configurationPageHandler));
  httpServer->addHandler("/restart", std::bind(&restartHandler));
  httpServer->addHandler("/set_config", std::bind(&saveConfigurationHandler));

  if (!wifiManager->connectToWifi(config))
  {
      CONFIG_MODE = true;
      wifiManager->setupAccessPoint();
      httpServer->start();
  }
}

void process() {
    Dht22SensorResult result = dht22Sensor->read(0);
    thingspeak->sendData(result.temperature, result.humidity);
    Serial.println("Needed " + String((int)result.numberOfReadAttemps) + " to read DHT22");
}

void loop()
{
  if (CONFIG_MODE)
  {
      httpServer->handleRequest();
  }
  else
  {
      process();

      int sleepTime = config.sleepInterval;
      if (sleepTime > 0)
      {
          Serial.println("Sleeping for " + String((int)sleepTime) + " Minutes");
          ESP.deepSleep(sleepTime * 60000000, WAKE_RF_DEFAULT);
      }
      else {
          delay(60 * 1000);
      }
  }
}
